/**
 * @file alg_queue.cpp
 * @author yssickjgd (1345578933@qq.com)
 * @brief 静态内存队列结构
 * @version 0.1
 * @date 2024-07-15 0.1 新增
 *
 * @copyright USTC-RoboWalker (c) 2024
 *
 */

/* Includes ------------------------------------------------------------------*/

#include "alg_queue.h"

/* Private macros ------------------------------------------------------------*/

/* Private types -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private function declarations ---------------------------------------------*/

/* Function prototypes -------------------------------------------------------*/

/************************ COPYRIGHT(C) USTC-ROBOWALKER **************************/
